vlm/base/Enums/ВидыОперацийЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПартииПриКорректировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗПриКорректировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСписанияПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеФормированияПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеФормированияПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеСведенийОСобранномУрожае</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеСведенийОСобранномУрожаеАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеСведенийОСобранномУрожаеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОстатковПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКлассификатораАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросМестФормированияПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросМестФормированияПартийАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтказовПогашенийСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПартийНаХранении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПартийРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПогашенийСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросРеестраЭлеваторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросРезультатовИсследований</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросРезультатовИсследованийАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСДИЗАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаПогашенияСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииСоздание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗКорректировочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗКорректировочныйРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОтказПогашенияСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОтказПогашенияСДИЗПриКорректировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОтказПогашенияСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗЭлеватор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗАннулированиеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартиийРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииИзДругихПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииИзОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииНаОсновеБумажногоСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииПоРезультатамГосмониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииПриСбореУрожая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииИзменениеСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАктовОтбораПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАктовОтбораПробАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/base/Documents/СписаниеПартийЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеПартийЗЕРНО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПартийЗЕРНО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Склад</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеВладельцаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНСИЗЕРНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПричины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеСписаниеПартийЗЕРНО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКПД2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗЕРНО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РеестрПартийЗЕРНО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/CommonModules/ЗаполнениеОбъектовПоСтатистикеЗЕРНО/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Заполнение документа "Формирование партии ЗЕРНО" по статистике
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ЦельИспользования                - СправочникСсылка.КлассификаторНСИЗЕРНО
//  * Организация                      - ОпределяемыйТип.Организация.
//  * Подразделение                    - ОпределяемыйТип.Подразделение.
//  * Операция                         - ПеречислениеСсылка.ВидыОперацийЗЕРНО
//  * ВидПродукции                     - ПеречислениеСсылка.ВидыПродукцииИС
//  * НазначениеПартии                 - СправочникСсылка.КлассификаторНСИЗЕРНО
//  * СтранаНазначения                 - СправочникСсылка.СтраныМира
//  * ГодУрожая                        - Число
//  * ВладелецПартии                   - ОпределяемыйТип.ОрганизацияКонтрагентГосИС.
//  * ПодразделениеВладельцаПартии     - ОпределяемыйТип.Подразделение
//  * ПоставитьПартиюНаХранение        - Булево
//  * Товаропроизводитель              - ОпределяемыйТип.ОрганизацияКонтрагентГосИС
//  * ПодразделениеТоваропроизводителя - ОпределяемыйТип.Подразделение.
Функция ДанныеЗаполненияФормированиеПартийЗЕРНО(Организация) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",                  ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация"));
	ДанныеЗаполнения.Вставить("Подразделение",                ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("ВидПродукции",                 Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("Операция",                     Перечисления.ВидыОперацийЗЕРНО.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("НазначениеПартии",             Справочники.КлассификаторНСИЗЕРНО.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("СтранаНазначения",             Неопределено);
	ДанныеЗаполнения.Вставить("ГодУрожая",                    2000);
	ДанныеЗаполнения.Вставить("ЦельИспользования",            Справочники.КлассификаторНСИЗЕРНО.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ВладелецПартии",               ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ОрганизацияКонтрагентГосИС"));
	ДанныеЗаполнения.Вставить("ПодразделениеВладельцаПартии", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("ПоставитьПартиюНаХранение",    Ложь);
	
	ДанныеЗаполнения.Вставить("Товаропроизводитель",              ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ОрганизацияКонтрагентГосИС"));
	ДанныеЗаполнения.Вставить("ПодразделениеТоваропроизводителя", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
	|	1                                         КАК Количество,
	|	Документ.Организация                      КАК Организация,
	|	Документ.Подразделение                    КАК Подразделение,
	|	Документ.ВидПродукции                     КАК ВидПродукции,
	|	Документ.ВладелецПартии                   КАК ВладелецПартии,
	|	Документ.ПодразделениеВладельцаПартии     КАК ПодразделениеВладельцаПартии,
	|	Документ.ПоставитьПартиюНаХранение        КАК ПоставитьПартиюНаХранение,
	|	Документ.Операция                         КАК Операция,
	|	Документ.НазначениеПартии                 КАК НазначениеПартии,
	|	Документ.СтранаНазначения                 КАК СтранаНазначения,
	|	Документ.ГодУрожая                        КАК ГодУрожая,
	|	Документ.ЦельИспользования                КАК ЦельИспользования,
	|	Документ.Товаропроизводитель              КАК Товаропроизводитель,
	|	Документ.ПодразделениеТоваропроизводителя КАК ПодразделениеТоваропроизводителя
	|ИЗ
	|	Документ.ФормированиеПартийЗЕРНО КАК Документ
	|ГДЕ
	|	(Документ.Организация = &Организация Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения.ВидПродукции = ВидПродукции(ДанныеПоследнихДокументов);
	
	ЗаполнитьПоСтатистике(
		"Организация",
		ДанныеЗаполнения, ДанныеПоследнихДокументов, "ВидПродукции");
		
	Если ДанныеЗаполнения.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродуктыПереработкиЗерна Тогда
		ЗаполнитьПоСтатистике(
			"Подразделение, Операция, НазначениеПартии, ЦельИспользования,
			|Товаропроизводитель, ПодразделениеТоваропроизводителя",
			ДанныеЗаполнения, ДанныеПоследнихДокументов, "Организация, ВидПродукции");
	ИначеЕсли ДанныеЗаполнения.ВидПродукции = Перечисления.ВидыПродукцииИС.Зерно Тогда
		ЗаполнитьПоСтатистике(
			"Подразделение, Операция, НазначениеПартии, ЦельИспользования, СтранаНазначения,
			|ВладелецПартии, ПодразделениеВладельцаПартии,
			|ГодУрожая, ПоставитьПартиюНаХранение",
			ДанныеЗаполнения, ДанныеПоследнихДокументов, "Организация, ВидПродукции");
	КонецЕсли;
	
	// Значения по-умолчанию
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.ВидПродукции) Тогда
		ДанныеЗаполнения.ВидПродукции = Перечисления.ВидыПродукцииИС.Зерно;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.Операция) Тогда
		Если ДанныеЗаполнения.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродуктыПереработкиЗерна Тогда
			ДанныеЗаполнения.Операция          = Перечисления.ВидыОперацийЗЕРНО.ФормированиеПартииИзОстатков;
		Иначе
			ДанныеЗаполнения.Операция          = Перечисления.ВидыОперацийЗЕРНО.ФормированиеПартииПриСбореУрожая;
			ДанныеЗаполнения.ГодУрожая         = Год(ТекущаяУниверсальнаяДата());
		КонецЕсли;
		ДанныеЗаполнения.НазначениеПартии  = Справочники.КлассификаторНСИЗЕРНО.НазначениеПартииХранениеОбработка;
		ДанныеЗаполнения.ЦельИспользования = Справочники.КлассификаторНСИЗЕРНО.ЦельИспользованияПартииПищевые;
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа "Формирование партии из других партий ЗЕРНО" по статистике
// Параметры:
//  Организация - ОпределяемыйТип.Организация.
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ЦельИспользования - СправочникСсылка.КлассификаторНСИЗЕРНО
//  * Организация       - ОпределяемыйТип.Организация.
//  * Подразделение     - ОпределяемыйТип.Подразделение.
//  * ВидПродукции      - ПеречислениеСсылка.ВидыПродукцииИС
//  * Операция          - ПеречислениеСсылка.ВидыОперацийЗЕРНО
//  * НазначениеПартии  - СправочникСсылка.КлассификаторНСИЗЕРНО
//  * ВладелецПартии    - ОпределяемыйТип.ОрганизацияКонтрагентГосИС.
Функция ДанныеЗаполненияФормированиеПартийИзДругихПартийЗЕРНО(Организация) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",                  ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация"));
	ДанныеЗаполнения.Вставить("Подразделение",                ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("ВидПродукции",                 Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("Операция",                     Перечисления.ВидыОперацийЗЕРНО.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("НазначениеПартии",             Справочники.КлассификаторНСИЗЕРНО.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ЦельИспользования",            Справочники.КлассификаторНСИЗЕРНО.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ВладелецПартии",               ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ОрганизацияКонтрагентГосИС"));
	ДанныеЗаполнения.Вставить("ПодразделениеВладельцаПартии", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("ГодУрожая",                    2000);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
	|	1                                     КАК Количество,
	|	Документ.Организация                  КАК Организация,
	|	Документ.Подразделение                КАК Подразделение,
	|	Документ.ВидПродукции                 КАК ВидПродукции,
	|	Документ.Операция                     КАК Операция,
	|	Документ.ВладелецПартии               КАК ВладелецПартии,
	|	Документ.ПодразделениеВладельцаПартии КАК ПодразделениеВладельцаПартии,
	|	Документ.НазначениеПартии             КАК НазначениеПартии,
	|	Документ.ГодУрожая                    КАК ГодУрожая,
	|	Документ.ЦельИспользования            КАК ЦельИспользования
	|ИЗ
	|	Документ.ФормированиеПартийИзДругихПартийЗЕРНО КАК Документ
	|ГДЕ
	|	(Документ.Организация = &Организация Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения.ВидПродукции = ВидПродукции(ДанныеПоследнихДокументов);
	
	ЗаполнитьПоСтатистике(
		"Организация, Подразделение, Операция, НазначениеПартии, ЦельИспользования, ВладелецПартии, ПодразделениеВладельцаПартии, ГодУрожая",
		ДанныеЗаполнения, ДанныеПоследнихДокументов, "ВидПродукции");
	
	// Значения по-умолчанию
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.ВидПродукции) Тогда
		ДанныеЗаполнения.ВидПродукции = Перечисления.ВидыПродукцииИС.Зерно;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.Операция) Тогда
		ДанныеЗаполнения.Операция          = Перечисления.ВидыОперацийЗЕРНО.ФормированиеПартииИзДругихПартий;
		ДанныеЗаполнения.НазначениеПартии  = Справочники.КлассификаторНСИЗЕРНО.НазначениеПартииХранениеОбработка;
		ДанныеЗаполнения.ЦельИспользования = Справочники.КлассификаторНСИЗЕРНО.ЦельИспользованияПартииПищевые;
		ДанныеЗаполнения.ГодУрожая         = Год(ТекущаяУниверсальнаяДата());
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа "Формирование партии при производстве ЗЕРНО" по статистике
// Параметры:
//  Организация - ОпределяемыйТип.Организация.
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ЦельИспользования   - СправочникСсылка.КлассификаторНСИЗЕРНО
//  * Организация         - ОпределяемыйТип.Организация
//  * Подразделение       - ОпределяемыйТип.Подразделение.
//  * Товаропроизводитель - ОпределяемыйТип.ОрганизацияКонтрагентГосИС.
//  * НазначениеПартии    - СправочникСсылка.КлассификаторНСИЗЕРНО
Функция ДанныеЗаполненияФормированиеПартийПриПроизводствеЗЕРНО(Организация) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",         ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация"));
	ДанныеЗаполнения.Вставить("Подразделение",       ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("Товаропроизводитель", Неопределено);
	ДанныеЗаполнения.Вставить("НазначениеПартии",    Справочники.КлассификаторНСИЗЕРНО.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ЦельИспользования",   Справочники.КлассификаторНСИЗЕРНО.ПустаяСсылка());
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
	|	1                             КАК Количество,
	|	Документ.Организация          КАК Организация,
	|	Документ.Подразделение        КАК Подразделение,
	|	Документ.НазначениеПартии     КАК НазначениеПартии,
	|	Документ.ЦельИспользования    КАК ЦельИспользования,
	|	Документ.Товаропроизводитель  КАК Товаропроизводитель
	|ИЗ
	|	Документ.ФормированиеПартийПриПроизводствеЗЕРНО КАК Документ
	|ГДЕ
	|	(Документ.Организация = &Организация Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ЗаполнитьПоСтатистике(
		"Организация, Подразделение, НазначениеПартии, ЦельИспользования, Товаропроизводитель",
		ДанныеЗаполнения, ДанныеПоследнихДокументов);
	
	// Значения по-умолчанию
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.НазначениеПартии) Тогда
		ДанныеЗаполнения.НазначениеПартии  = Справочники.КлассификаторНСИЗЕРНО.НазначениеПартииХранениеОбработка;
		ДанныеЗаполнения.ЦельИспользования = Справочники.КлассификаторНСИЗЕРНО.ЦельИспользованияПартииПищевые;
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа ЗапросОстатковПартийЗЕРНО по статистике
// Параметры:
//  Организация - ОпределяемыйТип.Организация
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * Организация    - ОпределяемыйТип.Организация.
//  * Подразделение  - ОпределяемыйТип.Подразделение.
//  * ВидПродукции   - ПеречислениеСсылка.ВидыПродукцииИС
//  * Операция       - ПеречислениеСсылка.ВидыОперацийЗЕРНО
//  * ВладелецПартии - ОпределяемыйТип.ОрганизацияКонтрагентГосИС
//  * Элеватор       - ОпределяемыйТип.ОрганизацияКонтрагентГосИС
Функция ДанныеЗаполненияЗапросаОстатковПартийЗЕРНО(Организация) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",                  ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация"));
	ДанныеЗаполнения.Вставить("Подразделение",                ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("ВидПродукции",                 Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("Операция",                     Перечисления.ВидыОперацийЗЕРНО.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ВладелецПартии",               ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ОрганизацияКонтрагентГосИС"));
	ДанныеЗаполнения.Вставить("ПодразделениеВладельцаПартии", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("Элеватор",                     ДанныеЗаполнения.ВладелецПартии);
	ДанныеЗаполнения.Вставить("ПодразделениеЭлеватора",       ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
	|	1                                     КАК Количество,
	|	Документ.Организация                  КАК Организация,
	|	Документ.Операция                     КАК Операция,
	|	Документ.Подразделение                КАК Подразделение,
	|	Документ.ВладелецПартии               КАК ВладелецПартии,
	|	Документ.ПодразделениеВладельцаПартии КАК ПодразделениеВладельцаПартии,
	|	Документ.ВидПродукции                 КАК ВидПродукции,
	|	Документ.Элеватор                     КАК Элеватор,
	|	Документ.ПодразделениеЭлеватора       КАК ПодразделениеЭлеватора
	|ИЗ
	|	Документ.ЗапросОстатковПартийЗЕРНО КАК Документ
	|ГДЕ
	|	(Документ.Организация = &Организация Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|	И Документ.Операция <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗЕРНО.ЗагрузкаОстатковПартий)
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения.ВидПродукции = ВидПродукции(ДанныеПоследнихДокументов);
	ЗаполнитьПоСтатистике(
		"Организация, Подразделение, Операция, ВладелецПартии, ПодразделениеВладельцаПартии, Элеватор, ПодразделениеЭлеватора",
		ДанныеЗаполнения, ДанныеПоследнихДокументов, "ВидПродукции");
	
	// Значения по-умолчанию
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.ВидПродукции) Тогда
		ВидыПродукции = ИнтеграцияЗЕРНОКлиентСерверПовтИсп.УчитываемыеВидыПродукции();
		Если ВидыПродукции.Количество() Тогда
			ДанныеЗаполнения.ВидПродукции = ВидыПродукции[0];
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа ВнесениеСведенийОСобранномУрожаеЗЕРНО" по статистике
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * Организация   - ОпределяемыйТип.Организация.
//  * Подразделение - ОпределяемыйТип.Подразделение.
//  * Склад         - ОпределяемыйТип.Склад
Функция ДанныеЗаполненияВнесениеСведенийОСобранномУрожаеЗЕРНО(Организация) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",   ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация"));
	ДанныеЗаполнения.Вставить("Подразделение", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
	|	1                      КАК Количество,
	|	Документ.Организация   КАК Организация,
	|	Документ.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО КАК Документ
	|ГДЕ
	|	(Документ.Организация = &Организация Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения.Организация = Организация(ДанныеПоследнихДокументов);
	ЗаполнитьПоСтатистике(
		"Организация, Подразделение",
		ДанныеЗаполнения, ДанныеПоследнихДокументов);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа "Списание партии ЗЕРНО" по статистике
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ЦельИспользования - СправочникСсылка.КлассификаторНСИЗЕРНО
//  * Организация       - ОпределяемыйТип.Организация.
//  * Подразделение     - ОпределяемыйТип.Подразделение.
//  * ВидПродукции      - ПеречислениеСсылка.ВидыПродукцииИС
//  * Операция          - ПеречислениеСсылка.ВидыОперацийЗЕРНО
//  * НазначениеПартии  - СправочникСсылка.КлассификаторНСИЗЕРНО
Функция ДанныеЗаполненияСписаниеПартийЗЕРНО(Организация) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",     ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация"));
	ДанныеЗаполнения.Вставить("Подразделение",   ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("ВидПродукции",    Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("Склад",           ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Склад"));
	ДанныеЗаполнения.Вставить("ПричинаСписания", Справочники.КлассификаторНСИЗЕРНО.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ОписаниеПричины", "");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
	|	1                          КАК Количество,
	|	Документ.Организация       КАК Организация,
	|	Документ.Подразделение     КАК Подразделение,
	|	Документ.ВидПродукции      КАК ВидПродукции,
	|	Документ.Склад             КАК Склад,
	|	Документ.ПричинаСписания   КАК ПричинаСписания,
	|	Документ.ОписаниеПричины   КАК ОписаниеПричины
	|ИЗ
	|	Документ.СписаниеПартийЗЕРНО КАК Документ
	|ГДЕ
	|	(Документ.Организация = &Организация Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения.ВидПродукции = ВидПродукции(ДанныеПоследнихДокументов);
	ЗаполнитьПоСтатистике(
		"Организация, Подразделение, Склад, ПричинаСписания, ОписаниеПричины",
		ДанныеЗаполнения, ДанныеПоследнихДокументов, "ВидПродукции");
	
	// Значения по-умолчанию
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.ВидПродукции) Тогда
		ВидыПродукции = ИнтеграцияЗЕРНОКлиентСерверПовтИсп.УчитываемыеВидыПродукции();
		Если ВидыПродукции.Количество() Тогда
			ДанныеЗаполнения.ВидПродукции = ВидыПродукции[0];
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа "Оформление СДИЗ ЗЕРНО" по статистике
// Параметры:
//  Организация - ОпределяемыйТип.Организация.
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * Организация - ОпределяемыйТип.Организация
//  * Подразделение - ОпределяемыйТип.Подразделение
//  * ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС
//  * Операция - ПеречислениеСсылка.ВидыОперацийЗЕРНО
Функция ДанныеЗаполненияОформлениеСДИЗЗЕРНО(Организация) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",   ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация"));
	ДанныеЗаполнения.Вставить("Подразделение", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("ВидПродукции",  Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("Операция",      Перечисления.ВидыОперацийЗЕРНО.ПустаяСсылка());
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
	|	1                          КАК Количество,
	|	Документ.Организация       КАК Организация,
	|	Документ.Подразделение     КАК Подразделение,
	|	Документ.ВидПродукции      КАК ВидПродукции,
	|	Документ.Операция          КАК Операция
	|ИЗ
	|	Документ.ОформлениеСДИЗЗЕРНО КАК Документ
	|ГДЕ
	|	(Документ.Организация = &Организация Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения.ВидПродукции = ВидПродукции(ДанныеПоследнихДокументов);
	
	ЗаполнитьПоСтатистике(
		"Организация, Подразделение, Операция",
		ДанныеЗаполнения, ДанныеПоследнихДокументов, "ВидПродукции");
	
	// Значения по-умолчанию
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.ВидПродукции) Тогда
		ДанныеЗаполнения.ВидПродукции = Перечисления.ВидыПродукцииИС.Зерно;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.Операция) Тогда
		ДанныеЗаполнения.Операция          = Перечисления.ВидыОперацийЗЕРНО.ОформлениеСДИЗРФ;
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа "Погашение СДИЗ ЗЕРНО" по статистике
// Параметры:
//  Организация - ОпределяемыйТип.Организация.
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * Организация   - ОпределяемыйТип.Организация.
//  * Подразделение - ОпределяемыйТип.Подразделение.
//  * ВидПродукции  - ПеречислениеСсылка.ВидыПродукцииИС
//  * Операция      - ПеречислениеСсылка.ВидыОперацийЗЕРНО
Функция ДанныеЗаполненияПогашениеСДИЗЗЕРНО(Организация) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",   ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация"));
	ДанныеЗаполнения.Вставить("Подразделение", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Подразделение"));
	ДанныеЗаполнения.Вставить("ВидПродукции",  Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
	|	1                          КАК Количество,
	|	Документ.Организация       КАК Организация,
	|	Документ.Подразделение     КАК Подразделение,
	|	Документ.ВидПродукции      КАК ВидПродукции
	|ИЗ
	|	Документ.ПогашениеСДИЗЗЕРНО КАК Документ
	|ГДЕ
	|	(Документ.Организация = &Организация Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(Организация));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения.ВидПродукции = ВидПродукции(ДанныеПоследнихДокументов);
	
	ЗаполнитьПоСтатистике(
		"Организация, Подразделение",
		ДанныеЗаполнения, ДанныеПоследнихДокументов, "ВидПродукции");
	
	// Значения по-умолчанию
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.ВидПродукции) Тогда
		ВидыПродукции = ИнтеграцияЗЕРНОКлиентСерверПовтИсп.УчитываемыеВидыПродукции();
		Если ВидыПродукции.Количество() Тогда
			ДанныеЗаполнения.ВидПродукции = ВидыПродукции[0];
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура ЗаполнитьПустойРеквизит(Объект, ДанныеСтатистики, ИмяРеквизита) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект[ИмяРеквизита])
		Или ТипЗнч(Объект[ИмяРеквизита]) = Тип("Булево") Тогда
		Объект[ИмяРеквизита] = ДанныеСтатистики[ИмяРеквизита];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВидПродукции(ДанныеПоследнихДокументов)
	
	ДанныеАнализа = ДанныеПоследнихДокументов.Скопировать(,"ВидПродукции, Количество");
	ДанныеАнализа.Свернуть("ВидПродукции", "Количество");
	ДанныеАнализа.Сортировать("Количество Убыв");
	Если ДанныеАнализа.Количество() > 0 Тогда
		ВидПродукции = ДанныеАнализа[0].ВидПродукции;
	КонецЕсли;
	
	Возврат ВидПродукции;
	
КонецФункции

Процедура ЗаполнитьПоСтатистике(Поля, ДанныеЗаполнения, ДанныеПоследнихДокументов, ПоляОтбора = "Организация")
	
	Отбор = Новый Структура;
	ОтбираемыеПоля = СтрРазделить(ПоляОтбора, ",");
	
	Для Каждого ПолеОтбора Из ОтбираемыеПоля Цикл
		ИмяПоля = СокрЛП(ПолеОтбора);
		Если ДанныеЗаполнения[ИмяПоля] <> Неопределено Тогда
			Отбор.Вставить(ИмяПоля, ДанныеЗаполнения[ИмяПоля]);
		КонецЕсли;
	КонецЦикла;
	
	Если Отбор.Количество() = 0 Тогда
		Отбор = Неопределено;
	КонецЕсли;
	
	ЗаполняемыеПоля = СтрРазделить(Поля, ",");
	
	РезультатыАнализа = ДанныеПоследнихДокументов.Скопировать(
		Отбор, Поля + ", Количество");
	
	РезультатыАнализа.Свернуть(Поля, "Количество");
	РезультатыАнализа.Сортировать("Количество Убыв");
	Если РезультатыАнализа.Количество() > 0 Тогда
		Для Каждого Поле Из ЗаполняемыеПоля Цикл
			ИмяПоля = СокрЛП(Поле);
			ДанныеЗаполнения[ИмяПоля] = РезультатыАнализа[0][ИмяПоля];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция Организация(ДанныеПоследнихДокументов)
	
	ДанныеАнализа = ДанныеПоследнихДокументов.Скопировать(,"Организация, Количество");
	ДанныеАнализа.Свернуть("Организация", "Количество");
	ДанныеАнализа.Сортировать("Количество Убыв");
	Если ДанныеАнализа.Количество() > 0 Тогда
		Организация = ДанныеАнализа[0].Организация;
	КонецЕсли;
	
	Возврат Организация;
	
КонецФункции

#КонецОбласти
